routes/web.php

    ]);
});

Route::get('/jobs', function () {
    // lazyquery
    // $jobs = Job::with('employer')->get();

    // with pagination
    $jobs = Job::with('employer')->paginate(3);


    return view('jobs', [
        "jobs" => $jobs,

    ]);
    // return ["foo" => "boo"];
});
---
select * from "employers" where "employers"."id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from "employers" where "employers"."id" in (1, 2, 3)